Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_container_node_pool.primary_nodes must be replaced
-/+ resource "google_container_node_pool" "primary_nodes" {
      ~ id                          = "projects/serverless-415915/locations/us-east1-b/clusters/knative-cluster/nodePools/primary-node-pool" -> (known after apply)
      ~ initial_node_count          = 1 -> (known after apply)
      ~ instance_group_urls         = [
          - "https://www.googleapis.com/compute/v1/projects/serverless-415915/zones/us-east1-b/instanceGroupManagers/gke-knative-cluster-primary-node-pool-1ff292e7-grp",
        ] -> (known after apply)
      ~ managed_instance_group_urls = [
          - "https://www.googleapis.com/compute/v1/projects/serverless-415915/zones/us-east1-b/instanceGroups/gke-knative-cluster-primary-node-pool-1ff292e7-grp",
        ] -> (known after apply)
      + max_pods_per_node           = (known after apply)
        name                        = "primary-node-pool"
      + name_prefix                 = (known after apply)
      ~ node_count                  = 4 -> 1
      ~ node_locations              = [
          - "us-east1-b",
        ] -> (known after apply)
      + operation                   = (known after apply)
      ~ project                     = "serverless-415915" -> (known after apply)
      ~ version                     = "1.29.0-gke.1381000" -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ autoscaling {
          ~ location_policy      = "ANY" -> (known after apply)
          - total_max_node_count = 0 -> null
          - total_min_node_count = 0 -> null
            # (2 unchanged attributes hidden)
        }

      - management {
          - auto_repair  = true -> null
          - auto_upgrade = true -> null
        }

      - network_config {
          - create_pod_range     = false -> null
          - enable_private_nodes = false -> null
        }

      ~ node_config {
          ~ disk_size_gb      = 100 -> (known after apply)
          ~ disk_type         = "pd-balanced" -> (known after apply)
          ~ guest_accelerator = [] -> (known after apply)
          ~ image_type        = "COS_CONTAINERD" -> (known after apply)
          ~ labels            = {} -> (known after apply)
          ~ local_ssd_count   = 0 -> (known after apply)
          ~ machine_type      = "e2-micro" -> "e2-small" # forces replacement
          ~ metadata          = {
              - "disable-legacy-endpoints" = "true"
            } -> (known after apply)
          + min_cpu_platform  = (known after apply)
          - resource_labels   = {} -> null
          ~ service_account   = "default" -> (known after apply)
          - tags              = [] -> null
          ~ taint             = [] -> (known after apply)
            # (4 unchanged attributes hidden)

          - shielded_instance_config {
              - enable_integrity_monitoring = true -> null
              - enable_secure_boot          = false -> null
            }
        }

      - upgrade_settings {
          - max_surge       = 1 -> null
          - max_unavailable = 0 -> null
          - strategy        = "SURGE" -> null
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d .`
* :put_litter_in_its_place: To **delete** this plan click [here](https://7edd93f2563f.ngrok.app/lock?id=peridotml%252Fserverless%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d .`
</details>
Plan: 1 to add, 0 to change, 1 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To **delete** all plans and locks for the PR, comment:
    * `atlantis unlock`